In [1]:
# will start chapter 8 here
import numpy as np
import pandas as pd

In [2]:
# hierarchical indexing
data = pd.Series(np.random.uniform(size = 9),
                 index = [["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                          [1, 2, 3, 1, 3, 1, 2, 2, 3]])

data

a  1    0.665935
   2    0.393098
   3    0.895438
b  1    0.422841
   3    0.276370
c  1    0.235586
   2    0.578051
d  2    0.366631
   3    0.781337
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data["b"]

1    0.422841
3    0.276370
dtype: float64

In [5]:
data["b":"c"]

b  1    0.422841
   3    0.276370
c  1    0.235586
   2    0.578051
dtype: float64

In [6]:
data.loc[["b", "d"]]

b  1    0.422841
   3    0.276370
d  2    0.366631
   3    0.781337
dtype: float64

In [7]:
data.loc[:, 2]

a    0.393098
c    0.578051
d    0.366631
dtype: float64

In [8]:
data.unstack()

          1         2         3
a  0.665935  0.393098  0.895438
b  0.422841       NaN  0.276370
c  0.235586  0.578051       NaN
d       NaN  0.366631  0.781337

In [9]:
data.unstack().stack()

a  1    0.665935
   2    0.393098
   3    0.895438
b  1    0.422841
   3    0.276370
c  1    0.235586
   2    0.578051
d  2    0.366631
   3    0.781337
dtype: float64

In [11]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index = [["a", "a", "b", "b"], [1, 2, 1, 2]],
                     columns = [["Ohio", "Ohio", "Colorado"],
                                ["Green", "Red", "Green"]])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [13]:
frame.index.names = ["key1", "key2"]
frame.columns.names = ["state", "color"]
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [14]:
frame.index.nlevels

2

In [15]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [16]:
pd.MultiIndex.from_arrays([["Ohio", "Ohio", "Colorado"],
                           ["Green", "Red", "Green"]],
                           names = ["state", "color"])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [17]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [18]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [19]:
frame.swaplevel(0, 1).sort_index(level = 0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [25]:
# summary statistitcs by level
frame.groupby(level = "key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [27]:
frame.T.groupby(level = "color").sum()

key1   a      b
key2   1  2   1   2
color
Green  2  8  14  20
Red    1  4   7  10

In [28]:
# indexing with a dataframe's columns
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
                      "c": ["one", "one", "one", "two", "two", "two", "two"],
                      "d": [0, 1, 2, 0, 1, 2, 3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [29]:
frame2 = frame.set_index(["c", "d"])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [30]:
frame.set_index(["c", "d"], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [31]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [33]:
# combining and merging datasets
# pd.merge - based on keys
# pd.concat - stacking on top
# combine_first - splice together overlapping data

df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"],
                    "data1": pd.Series(range(7), dtype = "Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "d"],
                    "data2": pd.Series(range(3), dtype = "Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [34]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [36]:
pd.merge(df1, df2, on = "key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [38]:
df3 = pd.DataFrame({"lkey": ["b", "b", "a", "c", "a", "a", "b"],
                    "data1": pd.Series(range(7), dtype = "Int64")})

df4 = pd.DataFrame({"rkey": ["a", "b", "d"],
                    "data2": pd.Series(range(3), dtype = "Int64")})

df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [39]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [40]:
pd.merge(df3, df4, left_on = "lkey", right_on = "rkey")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [41]:
pd.merge(df1, df2, how = "outer")

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [42]:
pd.merge(df3, df4, left_on = "lkey", right_on = "rkey", how = "outer")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [43]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                    "data1": pd.Series(range(6), dtype = "Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
                    "data2": pd.Series(range(5), dtype = "Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [44]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [45]:
pd.merge(df1, df2, on = "key", how = "left")

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [46]:
pd.merge(df1, df2, how = "inner")

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [48]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
                     "key2": ["one", "two", "one"],
                     "lval": pd.Series([1, 2, 3], dtype = 'Int64')})

right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                      "key2": ["one", "one", "one", "two"],
                      "rval": pd.Series([4, 5, 6, 7], dtype = 'Int64')})

left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [49]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [50]:
pd.merge(left, right, on = ["key1", "key2"], how = "outer")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2  <NA>
3  bar  one     3     6
4  bar  two  <NA>     7

In [51]:
pd.merge(left, right, on = "key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [52]:
pd.merge(left, right, on = "key1", suffixes = ("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [53]:
# merging on index
left1= pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                     "value": pd.Series(range(6), dtype = "Int64")})

right1 = pd.DataFrame({"group_val": [3.5, 7]}, index = ["a", "b"])

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [54]:
right1

   group_val
a        3.5
b        7.0

In [55]:
pd.merge(left1, right1, left_on = "key", right_index = True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [56]:
pd.merge(left1, right1, left_on = "key", right_index = True, how = "outer")

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [57]:
# concatenating along an axis
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [61]:
np.concatenate([arr, arr], axis = 1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [62]:
s1 = pd.Series([0, 1], index = ["a", "b"], dtype = "Int64")
s2 = pd.Series([2, 3, 4], index = ["c", "d", "e"], dtype = "Int64")
s3 = pd.Series([5, 6], index = ["f", "g"], dtype = "Int64")

s1

a    0
b    1
dtype: Int64

In [63]:
s2

c    2
d    3
e    4
dtype: Int64

In [64]:
s3

f    5
g    6
dtype: Int64

In [66]:
pd.concat([s1, s2, s3], axis = "columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [67]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: Int64

In [68]:
pd.concat([s1, s4], axis = "columns")

      0  1
a     0  0
b     1  1
f  <NA>  5
g  <NA>  6

In [69]:
pd.concat([s1, s4], axis = "columns", join = "inner")

   0  1
a  0  0
b  1  1

In [70]:
result = pd.concat([s1, s1, s3], keys = ["one", "two", "three"])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: Int64

In [71]:
result.unstack()

          a     b     f     g
one       0     1  <NA>  <NA>
two       0     1  <NA>  <NA>
three  <NA>  <NA>     5     6

In [72]:
pd.concat([s1, s2, s3], axis = "columns", keys = ["one", "two", "three"])

    one   two  three
a     0  <NA>   <NA>
b     1  <NA>   <NA>
c  <NA>     2   <NA>
d  <NA>     3   <NA>
e  <NA>     4   <NA>
f  <NA>  <NA>      5
g  <NA>  <NA>      6

In [73]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index = ["a", "b", "c"],
                   columns = ["one", "two"])

df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index = ["a", "c"],
                   columns = ["three", "four"])

df1

   one  two
a    0    1
b    2    3
c    4    5

In [74]:
df2

   three  four
a      5     6
c      7     8

In [75]:
pd.concat([df1, df2], axis = "columns", keys = ["level1", "level2"])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [76]:
pd.concat({"level1": df1, "level2": df2}, axis = "columns")

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [77]:
pd.concat([df1, df2], axis = "columns", keys = ["level1", "level2"],
          names = ["upper", "lower"])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [78]:
df1 = pd.DataFrame(np.random.standard_normal((3, 4)),
                   columns = ["a", "b", "c", "d"])

df2 = pd.DataFrame(np.random.standard_normal((2, 3)),
                   columns = ["b", "d", "a"])

df1

          a         b         c         d
0 -1.344842 -1.271640 -2.723284  1.192561
1 -1.140768 -0.653227  0.526066 -2.374607
2 -0.178705 -2.011845 -0.771619 -1.004170

In [79]:
df2

          b         d         a
0  0.172326  1.063621 -0.368353
1  0.551664 -0.428363 -0.694876

In [80]:
pd.concat([df1, df2], ignore_index = True)

          a         b         c         d
0 -1.344842 -1.271640 -2.723284  1.192561
1 -1.140768 -0.653227  0.526066 -2.374607
2 -0.178705 -2.011845 -0.771619 -1.004170
3 -0.368353  0.172326       NaN  1.063621
4 -0.694876  0.551664       NaN -0.428363

In [ ]:
# reshaping and pivoting